In [1]:
import numpy as np
import pandas as pd

In [4]:
s1 = pd.Series(range(0, 4))
s2 = pd.Series(range(1, 5))

In [5]:
s3 = s1 + s2

In [7]:
s4 = pd.Series(["a", "b"]) * 3
s4

0    aaa
1    bbb
dtype: object

In [8]:
idx = s1.index
print(idx, type(idx), sep="\t")

RangeIndex(start=0, stop=4, step=1)	<class 'pandas.core.indexes.range.RangeIndex'>

In [9]:
a = idx.values
print(a, type(a), sep="\t")

[0 1 2 3]	<class 'numpy.ndarray'>

In [10]:
list = idx.tolist()
print(list, type(list), sep="\t")

[0, 1, 2, 3]	<class 'list'>

In [11]:
idx = pd.Index([1,2,3])
print(s2[idx])

1    2
2    3
3    4
dtype: int64

In [13]:
print(idx.min())

1

In [14]:
print(idx.max())

3

In [15]:
# Dataframe

df = pd.DataFrame(np.random.randint(0, 100,[10,4]), columns = ["A", "B", "C", "D"])

In [16]:
df

    A   B   C   D
0   7  12  64  95
1  12  55  84  75
2  38  18  69  45
3  43  49  42  31
4  93  11  25  13
5  75  65  73  33
6  12  63  16  14
7  30  14  20  75
8  17  60  89  22
9   9  20  82  40

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
A    10 non-null int64
B    10 non-null int64
C    10 non-null int64
D    10 non-null int64
dtypes: int64(4)
memory usage: 400.0 bytes

In [19]:
df.head(10)

    A   B   C   D
0   7  12  64  95
1  12  55  84  75
2  38  18  69  45
3  43  49  42  31
4  93  11  25  13
5  75  65  73  33
6  12  63  16  14
7  30  14  20  75
8  17  60  89  22
9   9  20  82  40

In [20]:
df.tail(3)

    A   B   C   D
7  30  14  20  75
8  17  60  89  22
9   9  20  82  40

In [21]:
df.T

    0   1   2   3   4   5   6   7   8   9
A   7  12  38  43  93  75  12  30  17   9
B  12  55  18  49  11  65  63  14  60  20
C  64  84  69  42  25  73  16  20  89  82
D  95  75  45  31  13  33  14  75  22  40

In [24]:
df.shape

(10, 4)

In [25]:
df.size

40

In [26]:
#find the index of df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
df1 = df.rename(columns = {"A" : 1, "B": 2})

In [28]:
df1

    1   2   C   D
0   7  12  64  95
1  12  55  84  75
2  38  18  69  45
3  43  49  42  31
4  93  11  25  13
5  75  65  73  33
6  12  63  16  14
7  30  14  20  75
8  17  60  89  22
9   9  20  82  40

In [29]:
df["C"]

0    64
1    84
2    69
3    42
4    25
5    73
6    16
7    20
8    89
9    82
Name: C, dtype: int64

In [30]:
# the same as df["C"]
df.C

0    64
1    84
2    69
3    42
4    25
5    73
6    16
7    20
8    89
9    82
Name: C, dtype: int64

In [31]:
# extract as dataframe
df[["C"]]

    C
0  64
1  84
2  69
3  42
4  25
5  73
6  16
7  20
8  89
9  82

In [32]:
# more than one column
df[["A", "B", "C"]]

    A   B   C
0   7  12  64
1  12  55  84
2  38  18  69
3  43  49  42
4  93  11  25
5  75  65  73
6  12  63  16
7  30  14  20
8  17  60  89
9   9  20  82

In [33]:
type(df)

pandas.core.frame.DataFrame

In [34]:
df[df.columns[[1,2]]]

    B   C
0  12  64
1  55  84
2  18  69
3  49  42
4  11  25
5  65  73
6  63  16
7  14  20
8  60  89
9  20  82

In [35]:
df["NewColumn"] = range(len(df))

In [36]:
df.head()

    A   B   C   D  NewColumn
0   7  12  64  95          0
1  12  55  84  75          1
2  38  18  69  45          2
3  43  49  42  31          3
4  93  11  25  13          4

In [37]:
# df rows handleing
# columns use columns
# rows use index
df.index

RangeIndex(start=0, stop=10, step=1)

In [39]:
df1 = df.rename(index = {1:"B", 2:"C"})
df1.head()

    A   B   C   D  NewColumn
0   7  12  64  95          0
B  12  55  84  75          1
C  38  18  69  45          2
3  43  49  42  31          3
4  93  11  25  13          4

In [40]:
df.drop([3,5])

    A   B   C   D  NewColumn
0   7  12  64  95          0
1  12  55  84  75          1
2  38  18  69  45          2
4  93  11  25  13          4
6  12  63  16  14          6
7  30  14  20  75          7
8  17  60  89  22          8
9   9  20  82  40          9

In [41]:
# find a particular element in a data frame
# df[1,"B"] not work

# use loc[row name, column name]
df.loc[1,"B"]

55

In [43]:
# use iloc[row indexes, column index]
df.iloc[0,1]

12

In [44]:
# find row
df[1:2]

    A   B   C   D  NewColumn
1  12  55  84  75          1

In [45]:
# find column
df["A"]

0     7
1    12
2    38
3    43
4    93
5    75
6    12
7    30
8    17
9     9
Name: A, dtype: int64

In [46]:
df.A

0     7
1    12
2    38
3    43
4    93
5    75
6    12
7    30
8    17
9     9
Name: A, dtype: int64

In [51]:
df[["A","B", "C", "D", "NewColumn"]]

    A   B   C   D  NewColumn
0   7  12  64  95          0
1  12  55  84  75          1
2  38  18  69  45          2
3  43  49  42  31          3
4  93  11  25  13          4
5  75  65  73  33          5
6  12  63  16  14          6
7  30  14  20  75          7
8  17  60  89  22          8
9   9  20  82  40          9

In [53]:
# be careful, if you write only 1:2, it will be recognized as row selection
# the second is the column selection
df.loc[1:2, "A":"NewColumn"]

    A   B   C   D  NewColumn
1  12  55  84  75          1
2  38  18  69  45          2